create table employee_56(
id serial primary key,
employee_name varchar(50) unique not null
)

create table employee_56_actors(
       id serial primary key,
       id_employee int not null,
       foreign key (id_employee)
                   references employee(id),
      
)

insert into employee(employee_name)
values ('Питер Динклэйдж'),
       ('Кит Харингтон'),
       ('Эмили Кларк'),
       ('Лина Хиди'),
       ('София Тернер'),
       ('Мэйси Уильямс'),
       ('Николай Костер-Вальдау'),
       ('Иэн Глен'),
       ('Альфи Аллен'),
       ('Джон Брэдли'),
       ('Конлет Хилл'),
       ('Лиам Каннингем'),
       ('Гвендолин Кристи'),
       ('Эйдан Гиллен'),
       ('Айзек Хэмпстед-Райт'),
       ('Рори Макканн'),
       ('Натали Эммануэль'),
       ('Джером Флинн'),
       ('Джейкоб Андерсон'),
       ('Кристофер Хивью'),
       ('Кэрис ван Хаутен'),
       ('Чарльз Дэнс'),
       ('Ханна Мюрей'),
       ('Джек Глисон'),
       ('Натали Дормер'),
       ('Мишель Фэйрли'),
       ('Стивен Диллэйн'),
       ('Джо Демпси'),
       ('Дин-Чарльз Чэпмен'),
       ('Ричард Мэдден'),
       ('Михиль Хаусман'),
       ('Сибель Кекилли');
      
      


select * from employee


     
 